In [ ]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import MinMaxScaler

In [ ]:
data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['Norah', 'Mohammed', 'Faisal', 'Ali', 'Lama'],
    'Age': [19, 20, 'unknown', 'unknown', 21],
    'Gender': ['Female', 'Male', 'Male', 'Male', 'Female'],
    'Score': [85, 92, 78, 88, 'unknown']
}

In [ ]:
# Task 1: Load the dataset into a Pandas DataFrame
df = pd.DataFrame(data)

In [ ]:
print(df.head())

   Student_ID      Name      Age  Gender    Score
0           1     Norah       19  Female       85
1           2  Mohammed       20    Male       92
2           3    Faisal  unknown    Male       78
3           4       Ali  unknown    Male       88
4           5      Lama       21  Female  unknown

In [ ]:
# Task 2: Drop Columns that Aren't Useful
df.drop('Student_ID', axis=1, inplace=True)

In [ ]:
print(df.head())

       Name      Age  Gender    Score
0     Norah       19  Female       85
1  Mohammed       20    Male       92
2    Faisal  unknown    Male       78
3       Ali  unknown    Male       88
4      Lama       21  Female  unknown

In [ ]:
# Task 3: Handle Missing Values, replace unknown with NaN, Count missing values in each column and print the result
df.replace('unknown', np.nan, inplace=True)
missing_values = df.isnull().sum()
print(missing_values)

Name      0
Age       2
Gender    0
Score     1
dtype: int64

In [ ]:
print(df.head())

       Name   Age  Gender  Score
0     Norah  19.0  Female   85.0
1  Mohammed  20.0    Male   92.0
2    Faisal   NaN    Male   78.0
3       Ali   NaN    Male   88.0
4      Lama  21.0  Female    NaN

In [ ]:
# Task 4: Fill missing values in 'Age' and 'Score' with the mean, method -> mean()
df['Age'].fillna(df['Age'].mean(), inplace=True)
df['Score'].fillna(df['Score'].mean(), inplace=True)

In [ ]:
print(df.head())

       Name   Age  Gender  Score
0     Norah  19.0  Female  85.00
1  Mohammed  20.0    Male  92.00
2    Faisal  20.0    Male  78.00
3       Ali  20.0    Male  88.00
4      Lama  21.0  Female  85.75

In [ ]:
# Task 5: Convert Categorical Values to Numeric for gender column
df['Gender'] = df['Gender'].map({'Male': 0, 'Female': 1})

In [ ]:
print(df.head())

       Name   Age  Gender  Score
0     Norah  19.0       1  85.00
1  Mohammed  20.0       0  92.00
2    Faisal  20.0       0  78.00
3       Ali  20.0       0  88.00
4      Lama  21.0       1  85.75

In [ ]:
# Task 6: Apply Feature Scaling/Normalization for age and score columns using MinMaxScaler
scaler = MinMaxScaler()
df[['Age', 'Score']] = scaler.fit_transform(df[['Age', 'Score']])

In [ ]:
print(df.head())

       Name  Age  Gender     Score
0     Norah  0.0       1  0.500000
1  Mohammed  0.5       0  1.000000
2    Faisal  0.5       0  0.000000
3       Ali  0.5       0  0.714286
4      Lama  1.0       1  0.553571